package com.example.android.yamsd;

import android.util.Log;

import org.json.JSONArray;
import org.json.JSONException;

import java.io.UnsupportedEncodingException;

/**
 * Created by yurich on 03.04.16.
 *
 * Загрузчик исполнителей
 */

//TODO - реализовать загрузку из интернета
public class ArtistsLoaderTask {
    private final String LOG_TAG = getClass().getSimpleName();

    private String dummyArtists = "[\n" +
            "  {\n" +
            "    \"id\": 1080505,\n" +
            "    \"name\": \"Tove Lo\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\",\n" +
            "      \"dance\",\n" +
            "      \"electronics\"\n" +
            "    ],\n" +
            "    \"tracks\": 81,\n" +
            "    \"albums\": 22,\n" +
            "    \"link\": \"http://www.tove-lo.com/\",\n" +
            "    \"description\": \"б\u0088аВаЕаДб\u0081аКаАб\u008F аПаЕаВаИб\u0086аА аИ аАаВб\u0082аОб\u0080 аПаЕб\u0081аЕаН. а\u009EаНаА аПб\u0080аИаВаЛаЕаКаЛаА аК б\u0081аЕаБаЕ аВаНаИаМаАаНаИаЕ аВ 2013 аГаОаДб\u0083 б\u0081 аВб\u008BаПб\u0083б\u0081аКаОаМ б\u0081аИаНаГаЛаА ТЋHabitsТЛ, аНаО аНаАб\u0081б\u0082аОб\u008Fб\u0089аЕаГаО б\u0083б\u0081аПаЕб\u0085аА аДаОаБаИаЛаАб\u0081б\u008C б\u0081 б\u0080аЕаМаИаКб\u0081аОаМ б\u0085аИаП-б\u0085аОаП аПб\u0080аОаДб\u008Eб\u0081аЕб\u0080аА Hippie Sabotage аНаА б\u008Dб\u0082б\u0083 аПаЕб\u0081аНб\u008E, аКаОб\u0082аОб\u0080б\u008BаЙ аПаОаЛб\u0083б\u0087аИаЛ аНаАаЗаВаАаНаИаЕ ТЋStay HighТЛ. 4 аМаАб\u0080б\u0082аА 2014 аГаОаДаА аВб\u008Bб\u0088аЕаЛ аЕб\u0091 аДаЕаБб\u008Eб\u0082аНб\u008BаЙ аМаИаНаИ-аАаЛб\u008CаБаОаМ Truth Serum, аА 24 б\u0081аЕаНб\u0082б\u008FаБб\u0080б\u008F б\u008Dб\u0082аОаГаО аЖаЕ аГаОаДаА аДаЕаБб\u008Eб\u0082аНб\u008BаЙ б\u0081б\u0082б\u0083аДаИаЙаНб\u008BаЙ аАаЛб\u008CаБаОаМ Queen of the Clouds. аЂб\u0083аВаЕ а\u009Bб\u0083 б\u008FаВаЛб\u008FаЕб\u0082б\u0081б\u008F аАаВб\u0082аОб\u0080аОаМ аПаЕб\u0081аЕаН б\u0082аАаКаИб\u0085 аАб\u0080б\u0082аИб\u0081б\u0082аОаВ, аКаАаК Icona Pop, Girls Aloud аИ аЈаЕб\u0080 а\u009BаЛаОаЙаД.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/dfc531f5.p.1080505/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/dfc531f5.p.1080505/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 2915,\n" +
            "    \"name\": \"Ne-Yo\",\n" +
            "    \"genres\": [\n" +
            "      \"rnb\",\n" +
            "      \"pop\",\n" +
            "      \"rap\"\n" +
            "    ],\n" +
            "    \"tracks\": 256,\n" +
            "    \"albums\": 152,\n" +
            "    \"link\": \"http://www.neyothegentleman.com/\",\n" +
            "    \"description\": \"аОаБаЛаАаДаАб\u0082аЕаЛб\u008C б\u0082б\u0080б\u0091б\u0085 аПб\u0080аЕаМаИаИ а\u0093б\u0080б\u008DаМаМаИ, аАаМаЕб\u0080аИаКаАаНб\u0081аКаИаЙ аПаЕаВаЕб\u0086, аАаВб\u0082аОб\u0080 аПаЕб\u0081аЕаН, аПб\u0080аОаДб\u008Eб\u0081аЕб\u0080, аАаКб\u0082б\u0091б\u0080, б\u0084аИаЛаАаНб\u0082б\u0080аОаП. а\u0092 2009 аГаОаДб\u0083 аЖб\u0083б\u0080аНаАаЛ Billboard аПаОб\u0081б\u0082аАаВаИаЛ а\u009DаИ-а\u0099аО аНаА 57 аМаЕб\u0081б\u0082аО аВ б\u0080аЕаЙб\u0082аИаНаГаЕ ТЋа\u0090б\u0080б\u0082аИб\u0081б\u0082б\u008B аДаЕб\u0081б\u008Fб\u0082аИаЛаЕб\u0082аИб\u008FТЛ.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/15ae00fc.p.2915/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/15ae00fc.p.2915/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 91546,\n" +
            "    \"name\": \"Usher\",\n" +
            "    \"genres\": [\n" +
            "      \"rnb\",\n" +
            "      \"pop\",\n" +
            "      \"rap\"\n" +
            "    ],\n" +
            "    \"tracks\": 450,\n" +
            "    \"albums\": 183,\n" +
            "    \"link\": \"http://usherworld.com/\",\n" +
            "    \"description\": \"аАаМаЕб\u0080аИаКаАаНб\u0081аКаИаЙ аПаЕаВаЕб\u0086 аИ аАаКб\u0082б\u0091б\u0080. а\u009EаДаИаН аИаЗ б\u0081аАаМб\u008Bб\u0085 аКаОаМаМаЕб\u0080б\u0087аЕб\u0081аКаИ б\u0083б\u0081аПаЕб\u0088аНб\u008Bб\u0085 R&B-аМб\u0083аЗб\u008BаКаАаНб\u0082аОаВ аАб\u0084б\u0080аОаАаМаЕб\u0080аИаКаАаНб\u0081аКаОаГаО аПб\u0080аОаИб\u0081б\u0085аОаЖаДаЕаНаИб\u008F. а\u0092 аНаАб\u0081б\u0082аОб\u008Fб\u0089аЕаЕ аВб\u0080аЕаМб\u008F аПб\u0080аОаДаАаНаО аБаОаЛаЕаЕ 65 аМаИаЛаЛаИаОаНаОаВ аКаОаПаИаЙ аЕаГаО аАаЛб\u008CаБаОаМаОаВ аПаО аВб\u0081аЕаМб\u0083 аМаИб\u0080б\u0083. а\u0092б\u008BаИаГб\u0080аАаЛ б\u0081аЕаМб\u008C аПб\u0080аЕаМаИаЙ ТЋа\u0093б\u0080б\u008DаМаМаИТЛ, б\u0087аЕб\u0082б\u008Bб\u0080аЕ аПб\u0080аЕаМаИаИ World Music Awards, б\u0087аЕб\u0082б\u008Bб\u0080аЕ аПб\u0080аЕаМаИаИ American Music Award аИ аДаЕаВб\u008Fб\u0082аНаАаДб\u0086аАб\u0082б\u008C аПб\u0080аЕаМаИаЙ Billboard Music Awards. а\u0092аЛаАаДаЕаЛаЕб\u0086 б\u0081аОаБб\u0081б\u0082аВаЕаНаНаОаЙ аЗаВб\u0083аКаОаЗаАаПаИб\u0081б\u008BаВаАб\u008Eб\u0089аЕаЙ аКаОаМаПаАаНаИаИ US Records. а\u009EаН аЗаАаНаИаМаАаЕб\u0082 21 аМаЕб\u0081б\u0082аО аВ б\u0081аПаИб\u0081аКаЕ б\u0081аАаМб\u008Bб\u0085 б\u0083б\u0081аПаЕб\u0088аНб\u008Bб\u0085 аМб\u0083аЗб\u008BаКаАаНб\u0082аОаВ аПаО аВаЕб\u0080б\u0081аИаИ Billboard, аА б\u0082аАаКаЖаЕ аВб\u0082аОб\u0080аОаЕ аМаЕб\u0081б\u0082аО, б\u0083б\u0081б\u0082б\u0083аПаИаВ а\u00ADаМаИаНаЕаМб\u0083 аВ б\u0081аПаИб\u0081аКаЕ б\u0081аАаМб\u008Bб\u0085 б\u0083б\u0081аПаЕб\u0088аНб\u008Bб\u0085 аМб\u0083аЗб\u008BаКаАаНб\u0082аОаВ 2000-б\u0085 аГаОаДаОаВ. а\u0092 2010 аГаОаДб\u0083 аЖб\u0083б\u0080аНаАаЛ Glamour аВаКаЛб\u008Eб\u0087аИаЛ аЕаГаО аВ б\u0081аПаИб\u0081аОаК 50 б\u0081аАаМб\u008Bб\u0085 б\u0081аЕаКб\u0081б\u0083аАаЛб\u008CаНб\u008Bб\u0085 аМб\u0083аЖб\u0087аИаН.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/b0e14f75.p.91546/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/b0e14f75.p.91546/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 100500,\n" +
            "    \"name\": \"Jay Sean\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\",\n" +
            "      \"rap\",\n" +
            "      \"rnb\"\n" +
            "    ],\n" +
            "    \"tracks\": 106,\n" +
            "    \"albums\": 38,\n" +
            "    \"description\": \"аБб\u0080аИб\u0082аАаНб\u0081аКаИаЙ б\u0080б\u008DаПаЕб\u0080, б\u008FаВаЛб\u008Fб\u008Eб\u0089аИаЙб\u0081б\u008F аВб\u008Bб\u0085аОаДб\u0086аЕаМ аИаЗ а\u0098аНаДаИаИ. а аОаДаИаЛб\u0081б\u008F аВ аЗаАаПаАаДаНаОаМ а\u009BаОаНаДаОаНаЕ, а\u0090аНаГаЛаИб\u008F. а\u0092б\u008BаПб\u0083б\u0081б\u0082аИаЛ б\u0082б\u0080аИ аАаЛб\u008CаБаОаМаА Me Against Myself, My Own Way аИ All or Nothing.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/db35e57a.p.100500/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/db35e57a.p.100500/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 74614,\n" +
            "    \"name\": \"Kelly Rowland\",\n" +
            "    \"genres\": [\n" +
            "      \"rnb\",\n" +
            "      \"pop\",\n" +
            "      \"rap\"\n" +
            "    ],\n" +
            "    \"tracks\": 174,\n" +
            "    \"albums\": 106,\n" +
            "    \"link\": \"http://www.kellyrowland.com/\",\n" +
            "    \"description\": \"аАаМаЕб\u0080аИаКаАаНб\u0081аКаАб\u008F аПаЕаВаИб\u0086аА аИ аАаКб\u0082б\u0080аИб\u0081аА. а\u0092б\u008Bб\u0081б\u0082б\u0083аПаАаЕб\u0082 аВ б\u0081б\u0082аИаЛаЕ б\u0081аОаВб\u0080аЕаМаЕаНаНб\u008BаЙ б\u0080аИб\u0082аМ-б\u008DаНаД-аБаЛб\u008EаЗ, б\u008FаВаЛб\u008FаЕб\u0082б\u0081б\u008F аАаВб\u0082аОб\u0080аОаМ б\u0082аЕаКб\u0081б\u0082аОаВ аПаЕб\u0081аЕаН.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/be7f0f49.p.74614/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/be7f0f49.p.74614/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 1156,\n" +
            "    \"name\": \"Timbaland\",\n" +
            "    \"genres\": [\n" +
            "      \"rap\",\n" +
            "      \"pop\",\n" +
            "      \"dance\"\n" +
            "    ],\n" +
            "    \"tracks\": 227,\n" +
            "    \"albums\": 141,\n" +
            "    \"link\": \"http://www.timbalandmusic.com/\",\n" +
            "    \"description\": \"аАаМаЕб\u0080аИаКаАаНб\u0081аКаИаЙ б\u0080б\u008DаПаЕб\u0080, аМб\u0083аЗб\u008BаКаАаЛб\u008CаНб\u008BаЙ аПб\u0080аОаДб\u008Eб\u0081аЕб\u0080, аАб\u0080аАаНаЖаИб\u0080аОаВб\u0089аИаК аИ аАаВб\u0082аОб\u0080 аПаЕб\u0081аЕаН. а\u009Eб\u0081аНаОаВаАб\u0082аЕаЛб\u008C аЛаЕаЙаБаЛаА Mosley Music Group, аДаВб\u0083аКб\u0080аАб\u0082аНб\u008BаЙ аОаБаЛаАаДаАб\u0082аЕаЛб\u008C аПб\u0080аЕаМаИаЙ ТЋа\u0093б\u0080б\u008DаМаМаИТЛ.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/e33024d5.p.1156/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/e33024d5.p.1156/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 1150,\n" +
            "    \"name\": \"Keri Hilson\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\",\n" +
            "      \"rnb\",\n" +
            "      \"rap\"\n" +
            "    ],\n" +
            "    \"tracks\": 99,\n" +
            "    \"albums\": 64,\n" +
            "    \"description\": \"аАаМаЕб\u0080аИаКаАаНб\u0081аКаАб\u008F аПаЕаВаИб\u0086аА аИ аАаВб\u0082аОб\u0080 аПаЕб\u0081аЕаН аВ б\u0081б\u0082аИаЛаЕ б\u0081аОаВб\u0080аЕаМаЕаНаНаОаГаО R&B, б\u0080аАаБаОб\u0082аАаЕб\u0082 аНаА аЛаЕаЙаБаЛб\u008B Zone 4/Mosley Music Group/Interscope Records. аЏаВаЛб\u008FаЕб\u0082б\u0081б\u008F б\u0087аЛаЕаНаОаМ аОаБб\u008AаЕаДаИаНаЕаНаИб\u008F аАаВб\u0082аОб\u0080аОаВ аИ аПб\u0080аОаДб\u008Eб\u0081аЕб\u0080аОаВ, аИаЗаВаЕб\u0081б\u0082аНаОаГаО аКаАаК The Clutch.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/40598113.p.1150/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/40598113.p.1150/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 451523,\n" +
            "    \"name\": \"а\u009FаИб\u0086б\u0086аА\",\n" +
            "    \"genres\": [\n" +
            "      \"rusrap\"\n" +
            "    ],\n" +
            "    \"tracks\": 33,\n" +
            "    \"albums\": 11,\n" +
            "    \"link\": \"http://pizzamusic.ru/\",\n" +
            "    \"description\": \"аМб\u0083аЗб\u008BаКаАаЛб\u008CаНаАб\u008F аГб\u0080б\u0083аПаПаА, аОб\u0081аНаОаВаАаНаНаАб\u008F аВ 2009 аГаОаДб\u0083 аЁаЕб\u0080аГаЕаЕаМ а\u009Fб\u0080аИаКаАаЗб\u0087аИаКаОаВб\u008BаМ аИ аИб\u0081аПаОаЛаНб\u008Fб\u008Eб\u0089аАб\u008F аПаЕб\u0081аНаИ аНаА б\u0081б\u0082б\u008BаКаЕ б\u0082аАаКаИб\u0085 аЖаАаНб\u0080аОаВ, аКаАаК аПаОаП-б\u0081аОб\u0083аЛ, б\u0080аЕаГаГаИ, б\u0084аАаНаК аИ аДаАаЖаЕ б\u0080б\u008DаП.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/120513b9.p.451523/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/120513b9.p.451523/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 41110,\n" +
            "    \"name\": \"а\u0094аИаМаА а\u0091аИаЛаАаН\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\"\n" +
            "    ],\n" +
            "    \"tracks\": 119,\n" +
            "    \"albums\": 29,\n" +
            "    \"link\": \"http://bilandima.ru/\",\n" +
            "    \"description\": \"а\u0094аИаМаА а\u009DаИаКаОаЛаАаЕаВаИб\u0087 а\u0091аИаЛаАаН - б\u0080аОб\u0081б\u0081аИаЙб\u0081аКаИаЙ аПаЕаВаЕб\u0086, аБаОаЛаЕаЕ аИаЗаВаЕб\u0081б\u0082аНб\u008BаЙ аКаАаК а\u0094аИаМаА а\u0091аИаЛаАаН. а\u0092 аИб\u008EаНаЕ 2008 аГаОаДаА аПб\u0080аИаНб\u008FаЛ аДаАаНаНб\u008BаЙ аПб\u0081аЕаВаДаОаНаИаМ аВ аКаАб\u0087аЕб\u0081б\u0082аВаЕ аНаАб\u0081б\u0082аОб\u008Fб\u0089аЕаГаО аИаМаЕаНаИ аИ б\u0084аАаМаИаЛаИаИ. а\u0094аИаМаА а\u0091аИаЛаАаН аПб\u0080аЕаДб\u0081б\u0082аАаВаЛб\u008FаЛ а аОб\u0081б\u0081аИб\u008E аНаА аКаОаНаКб\u0083б\u0080б\u0081аЕ аПаЕб\u0081аНаИ ТЋа\u0095аВб\u0080аОаВаИаДаЕаНаИаЕТЛ аДаВаА б\u0080аАаЗаА: аВ 2006 аГаОаДб\u0083 б\u0081 аПаЕб\u0081аНаЕаЙ ТЋNever Let You GoТЛ, аЗаАаНб\u008FаВ аВб\u0082аОб\u0080аОаЕ аМаЕб\u0081б\u0082аО, аИ аВ 2008 аГаОаДб\u0083 б\u0081 аПаЕб\u0081аНаЕаЙ ТЋBelieveТЛ, аЗаАаНб\u008FаВ аПаЕб\u0080аВаОаЕ аМаЕб\u0081б\u0082аО аИ б\u0081б\u0082аАаВ аПаЕб\u0080аВб\u008BаМ б\u0080аОб\u0081б\u0081аИаЙб\u0081аКаИаМ аАб\u0080б\u0082аИб\u0081б\u0082аОаМ, аПаОаБаЕаДаИаВб\u0088аИаМ аНаА аКаОаНаКб\u0083б\u0080б\u0081аЕ аПаЕб\u0081аНаИ ТЋа\u0095аВб\u0080аОаВаИаДаЕаНаИаЕТЛ.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/20c848e3.p.41110/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/20c848e3.p.41110/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 166300,\n" +
            "    \"name\": \"а\u0091б\u008Cб\u008FаНаКаА\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\",\n" +
            "      \"rnb\"\n" +
            "    ],\n" +
            "    \"tracks\": 45,\n" +
            "    \"albums\": 13,\n" +
            "    \"link\": \"http://www.biankanumber1.ru/\",\n" +
            "    \"description\": \"аБаЕаЛаОб\u0080б\u0083б\u0081б\u0081аКаАб\u008F аИ б\u0080аОб\u0081б\u0081аИаЙб\u0081аКаАб\u008F R&B-аИб\u0081аПаОаЛаНаИб\u0082аЕаЛб\u008CаНаИб\u0086аА.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/f960f99a.p.166300/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/f960f99a.p.166300/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 161010,\n" +
            "    \"name\": \"а\u009Dб\u008Eб\u0088аА\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\"\n" +
            "    ],\n" +
            "    \"tracks\": 99,\n" +
            "    \"albums\": 34,\n" +
            "    \"link\": \"http://www.nyusha.ru/\",\n" +
            "    \"description\": \"б\u0080аОб\u0081б\u0081аИаЙб\u0081аКаАб\u008F аПаЕаВаИб\u0086аА, аАаВб\u0082аОб\u0080 аПаЕб\u0081аЕаН, аКаОаМаПаОаЗаИб\u0082аОб\u0080, аАаКб\u0082б\u0080аИб\u0081аА.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/7806607c.p.161010/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/7806607c.p.161010/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 155914,\n" +
            "    \"name\": \"а\u0092аИаНб\u0082аАаЖ\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\"\n" +
            "    ],\n" +
            "    \"tracks\": 91,\n" +
            "    \"albums\": 17,\n" +
            "    \"link\": \"http://www.vintagemusic.ru/\",\n" +
            "    \"description\": \"б\u0080аОб\u0081б\u0081аИаЙб\u0081аКаАб\u008F аПаОаП-аГб\u0080б\u0083аПаПаА, аВ б\u0081аОб\u0081б\u0082аАаВ аКаОб\u0082аОб\u0080аОаЙ аВб\u0085аОаДб\u008Fб\u0082 аПаЕаВаИб\u0086аА а\u0090аНаНаА а\u009FаЛаЕб\u0082аНб\u0091аВаА аИ аПаЕаВаЕб\u0086, аКаОаМаПаОаЗаИб\u0082аОб\u0080 аИ б\u0081аАб\u0083аНаД-аПб\u0080аОаДб\u008Eб\u0081аЕб\u0080 а\u0090аЛаЕаКб\u0081аЕаЙ а аОаМаАаНаОаВ. а аАаНаЕаЕ аВ б\u0081аОб\u0081б\u0082аАаВ аГб\u0080б\u0083аПаПб\u008B аВб\u0085аОаДаИаЛаИ б\u0082аАаНб\u0086аОаВб\u0089аИб\u0086б\u008B а\u009CаИб\u008F аИ аЁаВаЕб\u0082аЛаАаНаА а\u0098аВаАаНаОаВаА.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/42479f15.p.155914/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/42479f15.p.155914/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 159009,\n" +
            "    \"name\": \"а\u0093б\u0080аАаДб\u0083б\u0081б\u008B\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\"\n" +
            "    ],\n" +
            "    \"tracks\": 30,\n" +
            "    \"albums\": 5,\n" +
            "    \"link\": \"http://www.gradusy.com/\",\n" +
            "    \"description\": \"б\u0080аОб\u0081б\u0081аИаЙб\u0081аКаАб\u008F аПаОаП-аГб\u0080б\u0083аПаПаА аИаЗ аЁб\u0082аАаВб\u0080аОаПаОаЛб\u008F, аОб\u0081аНаОаВаАаНаНаАб\u008F аВ 2008 аГаОаДб\u0083. а\u009FаЕб\u0080аВб\u008BаЙ аКаОаНб\u0086аЕб\u0080б\u0082 аГб\u0080б\u0083аПаПаА аОб\u0082б\u008BаГб\u0080аАаЛаА аПаОаД аНаАаЗаВаАаНаИаЕаМ ТЋа\u0093б\u0080аАаДб\u0083б\u0081 100ТЛ 29 аМаАб\u008F 2008 аГаОаДаА\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/46f09c63.p.159009/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/46f09c63.p.159009/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 755171,\n" +
            "    \"name\": \"а\u0098аВаАаН а\u0094аОб\u0080аН\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\",\n" +
            "      \"rap\",\n" +
            "      \"electronics\"\n" +
            "    ],\n" +
            "    \"tracks\": 117,\n" +
            "    \"albums\": 43,\n" +
            "    \"link\": \"http://www.ivandorn.com\",\n" +
            "    \"description\": \"б\u0083аКб\u0080аАаИаНб\u0081аКаИаЙ аПаЕаВаЕб\u0086, аДаИаДаЖаЕаЙ аИ б\u0082аЕаЛаЕаВаЕаДб\u0083б\u0089аИаЙ, аБб\u008BаВб\u0088аИаЙ б\u0083б\u0087аАб\u0081б\u0082аНаИаК аГб\u0080б\u0083аПаПб\u008B ТЋа\u009FаАб\u0080аА а\u009DаОб\u0080аМаАаЛб\u008CаНб\u008Bб\u0085ТЛ.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/f8bb3e2e.p.755171/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/f8bb3e2e.p.755171/1000x1000\"\n" +
            "    }\n" +
            "  },\n" +
            "  {\n" +
            "    \"id\": 2392189,\n" +
            "    \"name\": \"а\u0090аНаДб\u0080аЕаЙ а\u009BаЕаНаИб\u0086аКаИаЙ\",\n" +
            "    \"genres\": [\n" +
            "      \"pop\"\n" +
            "    ],\n" +
            "    \"tracks\": 29,\n" +
            "    \"albums\": 4,\n" +
            "    \"link\": \"http://lenitsky.com/\",\n" +
            "    \"description\": \"аЃаКб\u0080аАаИаНб\u0081аКаИаЙ аМб\u0083аЗб\u008BаКаАаНб\u0082, б\u0081аОаЛаИб\u0081б\u0082, аАаВб\u0082аОб\u0080 аПаЕб\u0081аЕаН аИ аКаОаМаПаОаЗаИб\u0082аОб\u0080.\",\n" +
            "    \"cover\": {\n" +
            "      \"small\": \"http://avatars.yandex.net/get-music-content/db0fe697.p.2392189/300x300\",\n" +
            "      \"big\": \"http://avatars.yandex.net/get-music-content/db0fe697.p.2392189/1000x1000\"\n" +
            "    }\n" +
            "  }\n" +
            "]";

    public JSONArray getArtists() {
        try {
            //Требуется предварительно перевести страницу в другую кодировку
            return new JSONArray(new String(dummyArtists.getBytes("ISO-8859-5"), "UTF-8"));
        } catch (JSONException e) {
            Log.e(LOG_TAG, "Incorrect JSON: " + e);
        } catch (UnsupportedEncodingException e) {
                Log.e(LOG_TAG, "Troubles with encoding: " + e);
        }

        return null;
    }
}
